billing_cf/Enums/бестВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>бестИзменениеИндивидуальныхНастроекСезонности_ВозобновлениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменениеИндивидуальныхНастроекСезонности_ОграничениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестОбращения_ОбращениеФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестОбращения_ОбращениеЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНП_РегистрацияПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНПОбщий_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНПОбщий_РегистрацияПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_ЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_ЗаключениеДополнительногоСоглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_ПревышениеПДК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_ПрочиеДополнительныеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_АктБездоговорногоПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗакрытиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗаменаДоговораУОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗаявкаНаЗаключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ОткрытиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ПерезаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ЗаменаДоговораУОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ОтключениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ПодключениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ВозобновлениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ОграничениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ПодключениеУслугиПослеТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_РегистрацияОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктированиеНедопускаЮЛ_АктированиеНедопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктированиеНедопускаЮЛ_АктированиеДопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасоваяВедомость_ПлановоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасоваяВедомость_ФактическоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененитьРазрядностьОбъемовУслуг_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ВозвратПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ПереносПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_СчетНаОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_КорректировкаИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Исправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписиКнигПродажПокупок_КнигаПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписиКнигПродажПокупок_КнигаПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Пеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВосстановлениеЗадолженности_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБанкротства_ПризнаниеБанкротом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБанкротства_ОтменаБанкротства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризацияЗадолженности_РегистрацияРеструктуризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризацияЗадолженности_ОтменаРеструктуризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ПереносВозвратПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

billing_cf/CommonModules/бестРаботаСВидамиОперацийСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Заполнить список возможных операций форма списка 
// Заполнение списка выбора операций при создании документа
//
// Параметры:
//  ИмяДокумента	 - Строка
//  СписокОпераций	 - СписокЗначений 
//
Процедура ЗаполнитьСписокВозможныхОперацийФормаСписка(ИмяДокумента,СписокОпераций) Экспорт  
	
	Если ИмяДокумента = "бестЗаключениеДоговоровСЮридическимиЛицами" Тогда
		Если Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ") Тогда
			СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ОткрытиеДоговора,							"Регистрация характеристик договора");
		КонецЕсли;
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗакрытиеДоговора,								"Закрытие договора");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ПерезаключениеДоговора,						"Перезаключение договора");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_РегистрацияОбъекта,							"Регистрация объекта");
		Если энргОбщегоНазначения.ЗначениеКонстанты("бестИспользоватьДоговорнойБлок") Тогда
			СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение,						"Заявка на заключение");
		КонецЕсли;
		//СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_АктБездоговорногоПотребления,					"Акт бездоговорного потребления");
		//СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаменаДоговораУОбъекта,						"Замена договора у объекта");
		
		
	ИначеЕсли ИмяДокумента = "бестОперацияСПриборомУчетаНП" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ,									"Акт ввода прибора учета");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВыводПУ,									"Акт вывода прибора учета");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ,									"Акт замены прибора учета");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ,					"Акт замены вспомогательного прибора учета");

		
	ИначеЕсли ИмяДокумента = "бестОперацияСУслугамиНП" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги,								"Подключение услуги");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ОтключениеУслуги,								"Отключение услуги");	
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ОграничениеУслуги,								"Ограничение услуги");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ВозобновлениеУслуги,							"Возобновление услуги");
		
	ИначеЕсли ИмяДокумента = "бестОперацияСОбъектамиНП" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСОбъектами_ПодключениеОбъекта,							"Подключение объекта");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта,								"Отключение объекта");		
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ОперацияСОбъектами_ЗаменаДоговораУОбъекта,						"Замена договора у объекта");
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияПоказанийНП" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний,					"Регистрация показаний");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема,			"Регистрация контрольного съёма");		
		
	ИначеЕсли ИмяДокумента = "бестПерерасчетНП" тогда
		//СписокОпераций.добавить(Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет,									"Связанный перерасчет");
		//СписокОпераций.добавить(Перечисления.бестВидыОпераций.Перерасчет_ИзменениеПараметраРассчета,							"Изменение параметра рассчета");
		//СписокОпераций.добавить(Перечисления.бестВидыОпераций.Перерасчет_КорректировкаПоказаний,								"Корректировка показаний");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.Перерасчет_РучнойПерерасчет,										"Ручной перерасчет");
		
		
	ИначеЕсли ИмяДокумента = "бестОбращения" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.бестОбращения_ОбращениеФизическогоЛица,							"Обращение физического лица");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.бестОбращения_ОбращениеЮридическогоЛица,							"Обращение юридического лица");		
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияПоказанийНПОбщий" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний,					"Регистрация показаний");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема,			"Регистрация контрольного съёма");		
		
	ИначеЕсли ИмяДокумента = "бестИзменитьДанныеДляДополнительногоРасчета" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПревышениеПДК,					"Превышение ПДК");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие,			"Негативное воздействие");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПрочиеДополнительныеНачисления,	"Прочие дополнительные начисления");

	ИначеЕсли ИмяДокумента = "бестИзменитьНомерПломбыПрибораУчета" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_Опломбировка,							"Опломбировка");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_Распломбировка,						"Распломбировка");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы,							"Замена пломбы");
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияБездоговорногоБезучетногоПотребления" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление,	"Бездоговорное потребление");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление,	"Безучетное потребление");
		
	ИначеЕсли ИмяДокумента = "бестАктированиеНедопускаДопускаЮЛ" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.АктированиеНедопускаЮЛ_АктированиеДопуска,		"Актирование допуска");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.АктированиеНедопускаЮЛ_АктированиеНедопуска,		"Актирование недопуска");
		
	ИначеЕсли ИмяДокумента = "бестПочасоваяВедомость" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПочасоваяВедомость_ПлановоеПотребление,			"Плановое потребление");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПочасоваяВедомость_ФактическоеПотребление,		"Фактическое потребление");
		
	ИначеЕсли ИмяДокумента = "бестИзмененитьРазрядностьОбъемовУслуг" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ОбщаяНастройка,				"Общая настройка");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка,	"Индивидуальная настройка");
		
	ИначеЕсли ИмяДокумента = "бестКорректировкаЗадолженности" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа,				"Возврат платежа");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа,				"Перенос платежа");
		
	ИначеЕсли ИмяДокумента = "бестПлатежныйДокумент" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_СчетНаОстаток,				"Счет на остаток");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка,				"Корректировка");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_Исправление,				"Исправление");
		
	ИначеЕсли ИмяДокумента = "бестПерерасчетЭЭ" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПерерасчетЭЭ_КорректировкаИсправление,		"Корректировка/исправление");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПерерасчетЭЭ_СвязанныйПерерасчет,				"Связанный перерасчет");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ПерерасчетЭЭ_РучнойПерерасчет,				"Ручной перерасчет");
		
	ИначеЕсли ИмяДокумента = "бестЗаписиКнигПродажПокупок" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ЗаписиКнигПродажПокупок_КнигаПродаж,		"Книга продаж");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.ЗаписиКнигПродажПокупок_КнигаПокупок,		"Книга покупок");
		
	ИначеЕсли ИмяДокумента = "бестСписаниеВосстановлениеЗадолженности" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_СписаниеЗадолженности,			"Списание задолженности");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности,		"Восстановление задолженности");
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияБанкротства" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом,			"Признание банкротом");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.РегистрацияБанкротства_ОтменаБанкротства,				"Отмена банкротства");

	ИначеЕсли ИмяДокумента = "бестРеструктуризацияЗадолженности" тогда
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.РеструктуризацияЗадолженности_РегистрацияРеструктуризации,			"Регистрация реструктуризации");
		СписокОпераций.добавить(Перечисления.бестВидыОпераций.РеструктуризацияЗадолженности_ОтменаРеструктуризации,					"Отмена реструктуризации");
		
	Иначе
		МенеджерОбъектов 		= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + ИмяДокумента);
		врСписокОпераций 		= МенеджерОбъектов.ЗаполнитьСписокВозможныхОперацийФормаСписка();
		Для Каждого ЗначениеСписка Из врСписокОпераций Цикл
			СписокОпераций.Добавить(ЗначениеСписка.Значение, ЗначениеСписка.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьСписокВозможныхОперацийФормаСписка_Переопределяемый(ИмяДокумента, СписокОпераций);
	
КонецПроцедуры

Процедура ЗаполнитьСписокВозможныхОперацийФормаСписка_Переопределяемый(ИмяДокумента, СписокОпераций)
	
КонецПроцедуры

// Функция - Префикс формы
// Определение префикса формы по выбранному виду операции
//
// Параметры:
//  ИмяДокумента		 - Строка
//  ВыбранноеЗначение	 - ПеречислениеСсылка.бестВидыОпераций 
// 
// Возвращаемое значение:
//   Строка - Префикс формы 
//
Функция ПрефиксФормы(ИмяДокумента,ВыбранноеЗначение) Экспорт  
	Соотвествие  		= Новый Соответствие;
	Если ИмяДокумента = "бестЗаключениеДоговоровСЮридическимиЛицами" Тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ОткрытиеДоговора,								"ОткрытиеДоговора");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗакрытиеДоговора,								"ЗакрытиеПерезаключениеДоговора");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ПерезаключениеДоговора,						"ЗакрытиеПерезаключениеДоговора");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение,							"РегистрацияОбъекта");
		//Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_АктБездоговорногоПотребления,					"АктБездоговорногоПотребления");
		//Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаменаДоговораУОбъекта,						"ПерезаключениеДоговора");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСДоговором_РегистрацияОбъекта,							"РегистрацияОбъекта");
		
	ИначеЕсли ИмяДокумента = "бестОперацияСУслугамиНП" Тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги,								"ПодключениеУслуги");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ОтключениеУслуги,								"ОтключениеУслуги");	
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ОграничениеУслуги,								"ОграничениеУслуги");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ВозобновлениеУслуги,							"ВозобновлениеУслуги");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслугиПослеТП,						"ПодключениеУслугиПослеТП");
		
	ИначеЕсли ИмяДокумента = "бестОперацияСПриборомУчетаНП" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ,									"ВводПУ");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВыводПУ,									"ВыводПУ");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ,									"ЗаменаПУ");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ,					"ЗаменаПУ");
		
	ИначеЕсли ИмяДокумента = "бестОперацияСОбъектамиНП" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСОбъектами_ПодключениеОбъекта,							"ПодключениеОбъекта");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта,							"ОтключениеОбъекта");		
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ОперацияСОбъектами_ЗаменаДоговораУОбъекта,						"ЗаменаДоговораУОбъекта");
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияПоказанийНП" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний,					"РегистрацияПоказаний");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема,			"РегистрацияПоказаний");			
		
	ИначеЕсли ИмяДокумента = "бестПерерасчетНП" тогда
		//Соотвествие.Вставить(Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет,									"СвязанныйПерерасчет");
		//Соотвествие.Вставить(Перечисления.бестВидыОпераций.Перерасчет_ИзменениеПараметраРассчета,							"ИзменениеПараметраРассчета");
		//Соотвествие.Вставить(Перечисления.бестВидыОпераций.Перерасчет_КорректировкаПоказаний,								"КорректировкаПоказаний");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.Перерасчет_РучнойПерерасчет,										"РучнойПерерасчет");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет,									"СвязанныйПерерасчет");
		
	ИначеЕсли ИмяДокумента = "бестОбращения" тогда                                                     	
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестОбращения_ОбращениеФизическогоЛица,							"ОбращениеФизическогоЛица");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестОбращения_ОбращениеЮридическогоЛица,							"ОбращениеЮридическогоЛица");		
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияПоказанийНПОбщий" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний,					"РегистрацияПоказаний");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема,			"РегистрацияПоказаний");		
		
	ИначеЕсли ИмяДокумента = "бестИзменитьДанныеДляДополнительногоРасчета" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПревышениеПДК,					"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие,			"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПрочиеДополнительныеНачисления,	"");
		
	ИначеЕсли ИмяДокумента = "бестИзменитьНомерПломбыПрибораУчета" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_Опломбировка,					"Опломбировка");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_Распломбировка,					"Распломбировка");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы,					"ЗаменаПломбы");
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияБездоговорногоБезучетногоПотребления" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление,		"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление,			"");
		
	ИначеЕсли ИмяДокумента = "бестАктированиеНедопускаДопускаЮЛ" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.АктированиеНедопускаЮЛ_АктированиеДопуска,		"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.АктированиеНедопускаЮЛ_АктированиеНедопуска,		"");

	ИначеЕсли ИмяДокумента = "бестПочасоваяВедомость" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПочасоваяВедомость_ПлановоеПотребление,			"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПочасоваяВедомость_ФактическоеПотребление,		"");
		
	ИначеЕсли ИмяДокумента = "бестИзмененитьРазрядностьОбъемовУслуг" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ОбщаяНастройка,				"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка,		"");
		
	ИначеЕсли ИмяДокумента = "бестКорректировкаЗадолженности" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа,		"ВозвратПлатежа");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа,		"ПереносПлатежа");
		
	ИначеЕсли ИмяДокумента = "бестПлатежныйДокумент" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_Расчетный,						"Расчетный");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_СчетНаОстаток,					"СчетНаОстаток");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка,					"Расчетный");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_Исправление,					"Расчетный");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПлатежныйДокумент_Пеня,							"Пеня");
		
	ИначеЕсли ИмяДокумента = "бестПерерасчетЭЭ" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПерерасчетЭЭ_КорректировкаИсправление,			"КорректировкаИсправление");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПерерасчетЭЭ_СвязанныйПерерасчет,				"СвязанныйПерерасчет");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ПерерасчетЭЭ_РучнойПерерасчет,					"РучнойПерерасчет");

		
	ИначеЕсли ИмяДокумента = "бестЗаписиКнигПродажПокупок" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ЗаписиКнигПродажПокупок_КнигаПродаж,			"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.ЗаписиКнигПродажПокупок_КнигаПокупок,		"");

	ИначеЕсли ИмяДокумента = "бестСписаниеВосстановлениеЗадолженности" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_СписаниеЗадолженности,			"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности,		"");
		
	ИначеЕсли ИмяДокумента = "бестРегистрацияБанкротства" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом,			"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.РегистрацияБанкротства_ОтменаБанкротства,			"");

	ИначеЕсли ИмяДокумента = "бестРеструктуризацияЗадолженности" тогда
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.РеструктуризацияЗадолженности_РегистрацияРеструктуризации,			"");
		Соотвествие.Вставить(Перечисления.бестВидыОпераций.РеструктуризацияЗадолженности_ОтменаРеструктуризации,				"");

	Иначе
		МенеджерОбъектов 		= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + ИмяДокумента);
		врСоотвествие 			= МенеджерОбъектов.ПрефиксФормы();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Соотвествие,врСоотвествие,Ложь);
	КонецЕсли;  
	
	Возврат Соотвествие[ВыбранноеЗначение]; 
	
КонецФункции

#КонецОбласти
